{
  "facts": [
    "The first computer bug was an actual moth — found inside a Harvard Mark II in 1947.",
    "Python was named after Monty Python, not the snake — its creator wanted a short, unique name.",
    "The first high-level programming language was Fortran, released in 1957.",
    "The \"Hello, World!\" program became popular because of Brian Kernighan's 1978 book.",
    "Java was originally called Oak, named after an oak tree outside James Gosling's office.",
    "The first programmer in history was Ada Lovelace in the 1840s.",
    "Git was created by Linus Torvalds in 2005 to manage Linux kernel development.",
    "The first website went live on August 6, 1991 at CERN.",
    "Stack Overflow was launched in 2008 by Jeff Atwood and Joel Spolsky.",
    "The term \"debugging\" was inspired by removing actual insects from machines.",
    "Windows XP’s default wallpaper 'Bliss' is a real unedited photo.",
    "The QWERTY keyboard layout was designed to prevent mechanical jams in old typewriters.",
    "COBOL powers most of the world’s banking systems even today.",
    "JavaScript was created in just 10 days by Brendan Eich in 1995.",
    "The first computer virus was called Creeper and appeared in the early 1970s.",
    "The term \"cloud computing\" became mainstream around 2006.",
    "The first iPhone did not support third-party apps.",
    "WhatsApp was originally a simple status-update app.",
    "PHP originally stood for Personal Home Page.",
    "The Linux mascot Tux was inspired by a penguin that bit Linus Torvalds at a zoo.",
    "Unicode includes over 3,600 emoji characters.",
    "The original name for JavaScript was Mocha.",
    "NASA still uses programs written in the 1970s.",
    "Compiling C used to take *hours* on old hardware.",
    "HTML was never meant to be a programming language.",
    "JSON became popular because it was lightweight compared to XML.",
    "React was created by a Facebook engineer named Jordan Walke.",
    "The first computer game was 'Spacewar!' in 1962.",
    "The term \"algorithm\" comes from the name of a Persian mathematician, Al-Khwarizmi.",
    "The @ symbol in email addresses was chosen by Ray Tomlinson in 1971.",
    "HTTP was proposed in 1989 by Tim Berners-Lee.",
    "CSS was introduced in 1996 by Håkon Wium Lie.",
    "Java originally ran inside a browser as an applet.",
    "The first Android phone was the HTC Dream (G1) in 2008.",
    "Microsoft Word was first released in 1983.",
    "The term \"spam\" for junk email came from a Monty Python sketch.",
    "Elon Musk learned programming from a $40 book at age 12.",
    "The average programmer blinks half as often as normal when coding.",
    "Dark mode reduces battery usage on OLED screens.",
    "There are over 700 programming languages.",
    "Apple was founded on April Fools' Day, 1976.",
    "Machine learning is older than the internet — introduced in the 1950s.",
    "C++ was originally called \"C with Classes\".",
    "The first mouse prototype was made of wood.",
    "SQL is the third most used programming language worldwide.",
    "The first AI concept dates back to 1950 with Alan Turing's paper.",
    "Java logo's coffee cup represents Java coffee from Indonesia.",
    "The first email ever sent was \"QWERTYUIOP\".",
    "Blockchain was conceptualized in 1991 — long before Bitcoin.",
    "GitHub was launched in 2008.",
    "Linux runs on every major supercomputer in the world.",
    "The ENIAC computer weighed 30 tons.",
    "Unicode supports over 150 writing systems.",
    "The floppy disk icon still represents \"save\" even though floppy disks are obsolete.",
    "The term \"cookie\" in browsers comes from \"magic cookies\" in Unix.",
    "Google's first storage was built using LEGO bricks.",
    "Facebook's original name was \"TheFacebook\".",
    "C# was created by Anders Hejlsberg, who also made Turbo Pascal.",
    "Python relies on indentation instead of braces by design.",
    "Bugs exist even in NASA space code.",
    "Minecraft was written in Java by Markus Persson in just a week.",
    "Rust was voted the most loved programming language for years on Stack Overflow.",
    "Swift replaced Objective-C as Apple’s main development language in 2014.",
    "95% of ATM transactions run on legacy mainframes.",
    "The first GPU appeared in 1999 from NVIDIA.",
    "The PlayStation 2 is the best-selling console ever.",
    "TikTok uses AI to personalize its feed within minutes.",
    "WebAssembly allows near-native performance in browsers.",
    "The Chrome browser was released in 2008.",
    "The term \"server\" originally meant a physical human position.",
    "Apple's App Store launched with only 500 apps.",
    "The word \"robot\" comes from the Czech word \"robota\" meaning forced labor.",
    "Google’s first office was a rented garage.",
    "Every iPhone uses some form of machine learning internally.",
    "Microsoft Windows was originally just a GUI on top of DOS.",
    "Reddit was created in 3 weeks by two college students.",
    "VLC can play almost any media file because it includes its own codecs.",
    "YouTube was created by former PayPal employees.",
    "The first 1GB hard drive cost $40,000.",
    "The original Google search engine was called Backrub.",
    "PHP was once a set of CGI scripts.",
    "The Linux kernel has over 30 million lines of code.",
    "The world’s first laptop was released in 1981 and weighed 10 kg.",
    "Chrome uses multiple processes to prevent crashes.",
    "The App Store reached $1 billion faster than any software platform in history.",
    "Linux powers all Tesla cars.",
    "The word \"byte\" was created to avoid confusion with \"bit\".",
    "The first SMS ever sent was “Merry Christmas” in 1992.",
    "JSON was created by Douglas Crockford.",
    "The term \"open source\" was adopted in 1998.",
    "The average programmer spends more time reading code than writing it.",
    "RAM used to be measured in kilobytes.",
    "Compilers used to be sold as separate expensive products.",
    "HTML5 removed the need for Flash for most tasks.",
    "Most modern passwords can be cracked in milliseconds if weak.",
    "The first programming competition was held in 1970.",
    "Chrome’s V8 engine made JavaScript significantly faster.",
    "Google indexes hundreds of billions of pages.",
    "NASA used PowerPoint for spacecraft planning meetings.",
    "Most cyberattacks begin with phishing.",
    "Emoji are considered part of the Unicode standard.",
    "The term \"firewall\" originally referred to fireproof barriers in buildings.",
    "Quantum computers use qubits instead of bits.",
    "Bluetooth is named after King Harald Bluetooth of Denmark.",
    "The first VR headset was invented in 1968.",
    "There are more smartphones than humans on Earth.",
    "Cybersecurity spending exceeds $200 billion globally.",
    "The average website loads over 50 external resources.",
    "Coding bootcamps started becoming popular around 2012.",
    "The first CAPTCHA was created in 1997.",
    "CAPTCHA images of house numbers were once used to train Google Maps.",
    "Apple nearly went bankrupt in 1997 before the iMac launch.",
    "The Mac startup sound was created by Jim Reekes.",
    "Early websites had no CSS — everything was inline.",
    "The term \"full stack developer\" became popular in the 2010s.", 
  "The term \"spam\" for junk email came from a Monty Python sketch.",
  "Elon Musk taught himself programming from a $40 book and created a game at age 12.",
  "The first computer bug was an actual moth trapped in a relay.",
  "The original Apple I was sold as a motherboard only — buyers added their own case, keyboard and display.",
  "There was once a programming language designed specifically to write poetry.",
  "Early web servers used to run on home-built hardware with floppy drives as swap.",
  "Whitespace-only languages exist: code written using only spaces, tabs and newlines.",
  "Many keyboard shortcuts (like Ctrl+C) were inherited from terminal interrupt conventions.",
  "Some C compilers of the 1970s accepted English words as operators as an option.",
  "The GIF format was reverse-engineered by a teenager to create the first web animations.",
  "The first widely used high-level language (Fortran) was created to automate scientific calculations, not 'programming' in today's sense.",
  "NASA once had to patch a spacecraft in flight by sending carefully crafted commands from Earth.",
  "Some programmers intentionally use variable names in different languages to hide meaning from casual readers.",
  "There exists a conserved set of bit patterns that reliably flip certain bits on some old RAM chips when read repeatedly.",
  "The UNIX 'toilet' command (yes, real) was made as a joke but later included in some distros.",
  "There are esoteric languages designed so the source code is also valid music.",
  "A single misplaced semicolon has caused billion-dollar losses in production systems.",
  "Some old keyboards sent characters as whole words (e.g., 'ESCAPE') rather than control codes.",
  "The first emoji set was created by a Japanese engineer to help pager users express emotions.",
  "There are programming languages where the program's layout (whitespace) encodes most of its logic more than tokens.",
  "A number of early home computers had undocumented instructions that developers later used like hidden features.",
  "Before source control, developers mailed floppy disks of patches to each other across the world.",
  "There are algorithms that were rediscovered independently dozens of times under different names.",
  "Some CPUs have instruction encodings reserved but never documented — OS developers exploited them for performance hacks.",
  "There's a stylesheet trick that lets text appear reversed without changing the actual DOM order.",
  "Early chatbots used pattern-matching rules small enough to fit on a single punch card.",
  "Programmers once used paper tape notches as a crude copy-protection and version marker.",
  "A handful of modern CI systems still support build runners running on Commodore-era machines via emulation.",
  "The first web browser was also an editor — you could edit pages directly in it.",
  "Some fonts contain hidden ligatures that, when typed, trigger entirely different characters (used by designers as Easter eggs).",
  "The canonical test for some programming languages was originally a single line of poetry used as a stress test.",
  "There exists a bug class that only manifests on machines cooled below a certain temperature.",
  "Memory alignment rules in old RISC chips led to file formats intentionally padded to match caches.",
  "There are historical programming contests judged by human readers rather than automated tests.",
  "Some terminal emulators intentionally implement a handful of odd legacy control codes for compatibility with obscure 1980s software.",
  "The longest-running piece of continuously executing code is a research experiment that has been active for decades on the same machine image.",
  "Compiler vendors sometimes include tiny jokes in error messages that are only visible with specific flags.",
  "Early email systems used 'bang paths' (route paths) to reach users across networks before DNS.",
  "A small set of open-source projects still accept patches only via physical mail (for legal/historic reasons).",
  "There is a debugging technique that involves changing system time to reproduce rare race conditions.",
  "Some of the earliest unit tests were handwritten notebooks of expected numeric sequences from simulations.",
  "A few database engines implement hidden 'magic' tables for diagnostics that administrators rarely know about.",
  "There were programming languages that used graphical tiles instead of text tokens to build programs.",
  "Some security exploits rely on predictable behavior of memory allocators on a specific libc version.",
  "There are compiled programs intentionally written to be musically playable when interpreted as MIDI bytes.",
  "The first web servers in some countries ran on machines with stamped government labels as the only available hardware.",
  "Several widely used libraries started as weekend projects for a single developer who later open-sourced them.",
  "In the early days, some printers used control sequences that double as primitive programming languages.",
  "There are build systems designed so that the build graph itself is a serializable program you can ship as an artifact.",
  "A few modern programming languages keep legacy syntactic features only to maintain compatibility with century-old code.",
  "The first commercial virus was created as a demonstration and accidentally spread beyond its creator's machine.",
  "Some terminals render certain Unicode sequences by switching to small embedded bitmap fonts stored in ROM.",
  "The earliest IDEs used microfilm for very long-term archival of code listings.",
  "There exist tiny Turing-complete languages intentionally designed to fit in a single tweet.",
  "A number of standard library functions exist primarily because a prominent academic used them in a famous paper.",
  "There was a time when professional programmers arranged code on pages to be readable by CRT refresh flicker rates.",
  "Old math libraries included fudge factors to match published tables that themselves had rounding quirks.",
  "A few compilers will output different code when compiled on different weekdays because of seeded non-determinism.",
  "Some operating systems used to expose raw hardware registers to userland; games relied on that behavior.",
  "There are art projects where visual sculptures are built entirely from repurposed server boards.",
  "Certain debugging symbols can leak the file system layout and developer usernames unless stripped.",
  "A specific error message phrasing became an inside joke across decades of mailing lists.",
  "Some device drivers expose undocumented ioctl codes used by diagnostic tools at hardware shops.",
  "There is a vector font deliberately designed so its glyph outlines spell hidden messages when concatenated.",
  "A few programming languages maintain legacy keywords that no compiler uses — only to make certain obfuscated programs possible.",
  "Early versions of some languages allowed leading zeros to mean different numeric bases; many bugs still trace back to that rule.",
  "The first javascript engines were optimized primarily for string manipulation because web pages were text-heavy.",
  "Some package managers support installing from physical media images without network access as a legacy mode.",
  "There are emulator projects that emulate hardware bugs because software historically depended on those bugs.",
  "A number of high-frequency trading shops still run code on physical servers placed in the same rack as exchange hardware for latency.",
  "Certain binary formats include deliberately unused fields reserved for defunct features of the original spec.",
  "There are filesystems built to be tamper-evident so that any modification creates an audit trail in metadata.",
  "Some chatbot datasets contain conversation snippets from pre-internet bulletin boards preserved by hobbyists.",
  "A small set of programming competitions used to grade by timing how fast humans could read and verify proofs.",
  "There are languages with syntax that changes meaning depending on the font used to display the source.",
  "Some browsers implement 'quirks mode' behaviors to faithfully render broken historical websites.",
  "A lot of domain-specific languages exist inside big companies and are never published outside.",
  "The common phrase 'rubber duck debugging' has roots in a programmer who literally used a toy duck for solving a bug.",
  "Some build artifacts accidentally contain full private keys because of debug flags left enabled — discovered years later.",
  "There exists a cache of ancient BBS message archives that include early open-source project discussions not found elsewhere.",
  "In some graphics hardware, the order of drawing identical objects can change their numeric rounding, subtly altering results.",
  "Many popular frameworks contain one-liner functions copied from obscure textbooks decades ago.",
  "A handful of open-source projects include 'time capsule' commits with notes to future maintainers hidden in code comments.",
  "There are compilers that intentionally randomize register allocation to find latent bugs in code relying on specific registers.",
  "Some languages support compile-time execution of arbitrary code, allowing programs to generate parts of themselves.",
  "A weird class of bugs only appears when the CPU's microcode is patched to a specific revision.",
  "There are file formats that double as images when rendered (steganographic formats used as playful puzzles).",
  "Several famous engineers once submitted code by hand-delivering magnetic tapes to data centers.",
  "The earliest networked games used postal mail to exchange game states between players in different cities.",
  "Some database indexes are optimized by human experts who tune page layouts for specific query shapes.",
  "There are retrocomputing communities that keep working hardware alive with bespoke soldered replacements.",
  "Software patents once claimed trivial algorithms that later were invalidated but changed industry practices.",
  "The same random seed used across generations of hardware produced surprisingly similar simulation outcomes.",
  "A portion of early open-source repositories were mirrored on Usenet and are retrievable from net archives.",
  "Some programming language definitions include an appendix of intentional ambiguity used as exam questions.",
  "There are projects that intentionally write unreadable code to test automated code formatting tools.",
  "Certain low-level optimizations rely on alignment patterns found only in memory allocators from a particular vendor.",
  "A few markets used customized firmware with bespoke networking protocols for point-of-sale terminals.",
  "There's an old standard for metadata in images that contains whimsical fields like 'mood' or 'weather'.",
  "Some telemetry systems were designed to survive nuclear events and use redundant coding tricks unfamiliar to modern devs.",
  "There are popular open-source tools whose original authors stopped maintaining them but never transferred ownership, leaving them 'orphaned'.",
  "A surprising number of programming jokes originated as acceptance-test comments in code that escaped into commits.",
  "There are compilers that include a 'conformance level' flag that disables community jokes and nonstandard conveniences.",
  "Some vintage programming magazines printed machine-readable code as audio tones people recorded on cassette tapes.",
  "A legacy printer protocol encodes status messages that look like short human-readable phrases when mis-parsed.",
  "There exist domain-specific assemblers created to teach hardware designers about microcode sequencing.",
  "A few obscure operating systems implemented process scheduling as a priority auction where processes bid CPU time.",
  "There are algorithms whose only practical use remained inside a single research paper and are otherwise unused.",
  "Some UI toolkits still include widgets designed to mimic early CRT-era interfaces for nostalgia.",
  "The 'Hello World' tradition started as a sanity test for a textbook on a brand-new language implementation.",
  "There are tiny bootloaders smaller than 512 bytes that fit in the earliest MBR sectors and still can load simple apps."
  ]
}
