{
  "facts": [
    "The first computer bug was an actual moth — found inside a Harvard Mark II in 1947.",
    "Python was named after Monty Python, not the snake — its creator wanted a short, unique name.",
    "The first high-level programming language was Fortran, released in 1957.",
    "The \"Hello, World!\" program became popular because of Brian Kernighan's 1978 book.",
    "Java was originally called Oak, named after an oak tree outside James Gosling's office.",
    "The first programmer in history was Ada Lovelace in the 1840s.",
    "Git was created by Linus Torvalds in 2005 to manage Linux kernel development.",
    "The first website went live on August 6, 1991 at CERN.",
    "Stack Overflow was launched in 2008 by Jeff Atwood and Joel Spolsky.",
    "The term \"debugging\" was inspired by removing actual insects from machines.",
    "Windows XP’s default wallpaper 'Bliss' is a real unedited photo.",
    "The QWERTY keyboard layout was designed to prevent mechanical jams in old typewriters.",
    "COBOL powers most of the world’s banking systems even today.",
    "JavaScript was created in just 10 days by Brendan Eich in 1995.",
    "The first computer virus was called Creeper and appeared in the early 1970s.",
    "The term \"cloud computing\" became mainstream around 2006.",
    "The first iPhone did not support third-party apps.",
    "WhatsApp was originally a simple status-update app.",
    "PHP originally stood for Personal Home Page.",
    "The Linux mascot Tux was inspired by a penguin that bit Linus Torvalds at a zoo.",
    "Unicode includes over 3,600 emoji characters.",
    "The original name for JavaScript was Mocha.",
    "NASA still uses programs written in the 1970s.",
    "Compiling C used to take *hours* on old hardware.",
    "HTML was never meant to be a programming language.",
    "JSON became popular because it was lightweight compared to XML.",
    "React was created by a Facebook engineer named Jordan Walke.",
    "The first computer game was 'Spacewar!' in 1962.",
    "The term \"algorithm\" comes from the name of a Persian mathematician, Al-Khwarizmi.",
    "The @ symbol in email addresses was chosen by Ray Tomlinson in 1971.",
    "HTTP was proposed in 1989 by Tim Berners-Lee.",
    "CSS was introduced in 1996 by Håkon Wium Lie.",
    "Java originally ran inside a browser as an applet.",
    "The first Android phone was the HTC Dream (G1) in 2008.",
    "Microsoft Word was first released in 1983.",
    "The term \"spam\" for junk email came from a Monty Python sketch.",
    "Elon Musk learned programming from a $40 book at age 12.",
    "The average programmer blinks half as often as normal when coding.",
    "Dark mode reduces battery usage on OLED screens.",
    "There are over 700 programming languages.",
    "Apple was founded on April Fools' Day, 1976.",
    "Machine learning is older than the internet — introduced in the 1950s.",
    "C++ was originally called \"C with Classes\".",
    "The first mouse prototype was made of wood.",
    "SQL is the third most used programming language worldwide.",
    "The first AI concept dates back to 1950 with Alan Turing's paper.",
    "Java logo's coffee cup represents Java coffee from Indonesia.",
    "The first email ever sent was \"QWERTYUIOP\".",
    "Blockchain was conceptualized in 1991 — long before Bitcoin.",
    "GitHub was launched in 2008.",
    "Linux runs on every major supercomputer in the world.",
    "The ENIAC computer weighed 30 tons.",
    "Unicode supports over 150 writing systems.",
    "The floppy disk icon still represents \"save\" even though floppy disks are obsolete.",
    "The term \"cookie\" in browsers comes from \"magic cookies\" in Unix.",
    "Google's first storage was built using LEGO bricks.",
    "Facebook's original name was \"TheFacebook\".",
    "C# was created by Anders Hejlsberg, who also made Turbo Pascal.",
    "Python relies on indentation instead of braces by design.",
    "Bugs exist even in NASA space code.",
    "Minecraft was written in Java by Markus Persson in just a week.",
    "Rust was voted the most loved programming language for years on Stack Overflow.",
    "Swift replaced Objective-C as Apple’s main development language in 2014.",
    "95% of ATM transactions run on legacy mainframes.",
    "The first GPU appeared in 1999 from NVIDIA.",
    "The PlayStation 2 is the best-selling console ever.",
    "TikTok uses AI to personalize its feed within minutes.",
    "WebAssembly allows near-native performance in browsers.",
    "The Chrome browser was released in 2008.",
    "The term \"server\" originally meant a physical human position.",
    "Apple's App Store launched with only 500 apps.",
    "The word \"robot\" comes from the Czech word \"robota\" meaning forced labor.",
    "Google’s first office was a rented garage.",
    "Every iPhone uses some form of machine learning internally.",
    "Microsoft Windows was originally just a GUI on top of DOS.",
    "Reddit was created in 3 weeks by two college students.",
    "VLC can play almost any media file because it includes its own codecs.",
    "YouTube was created by former PayPal employees.",
    "The first 1GB hard drive cost $40,000.",
    "The original Google search engine was called Backrub.",
    "PHP was once a set of CGI scripts.",
    "The Linux kernel has over 30 million lines of code.",
    "The world’s first laptop was released in 1981 and weighed 10 kg.",
    "Chrome uses multiple processes to prevent crashes.",
    "The App Store reached $1 billion faster than any software platform in history.",
    "Linux powers all Tesla cars.",
    "The word \"byte\" was created to avoid confusion with \"bit\".",
    "The first SMS ever sent was “Merry Christmas” in 1992.",
    "JSON was created by Douglas Crockford.",
    "The term \"open source\" was adopted in 1998.",
    "The average programmer spends more time reading code than writing it.",
    "RAM used to be measured in kilobytes.",
    "Compilers used to be sold as separate expensive products.",
    "HTML5 removed the need for Flash for most tasks.",
    "Most modern passwords can be cracked in milliseconds if weak.",
    "The first programming competition was held in 1970.",
    "Chrome’s V8 engine made JavaScript significantly faster.",
    "Google indexes hundreds of billions of pages.",
    "NASA used PowerPoint for spacecraft planning meetings.",
    "Most cyberattacks begin with phishing.",
    "Emoji are considered part of the Unicode standard.",
    "The term \"firewall\" originally referred to fireproof barriers in buildings.",
    "Quantum computers use qubits instead of bits.",
    "Bluetooth is named after King Harald Bluetooth of Denmark.",
    "The first VR headset was invented in 1968.",
    "There are more smartphones than humans on Earth.",
    "Cybersecurity spending exceeds $200 billion globally.",
    "The average website loads over 50 external resources.",
    "Coding bootcamps started becoming popular around 2012.",
    "The first CAPTCHA was created in 1997.",
    "CAPTCHA images of house numbers were once used to train Google Maps.",
    "Apple nearly went bankrupt in 1997 before the iMac launch.",
    "The Mac startup sound was created by Jim Reekes.",
    "Early websites had no CSS — everything was inline.",
    "The term \"full stack developer\" became popular in the 2010s."
  ]
}
